Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: K-KAKIKU..?!
en: my leg?!

source: MINNIE..
en: sarimin...

source: PAK!!
en: watch out!!!

source: ..ORANG ITU,
en: that man...

source: Tak jadi masalah dan tak jadi beban pikiran..
en: he will not let it bother him or weigh him down.

source: LOH, LOH..?
en: hey...

source: BANYAK DEDEMIT DARI HUTAN DAN DESA JUGA!
en: the ghosts from the forest and the village are coming too!

source: DIA HANYA ANAK KECIL, SEHARUS-NYA AKU TIDAK TER-BAWA EMOSI..
en: she’s just a little girl... I shouldn’t have lashed out on her like that.

source: BEGITU?
en: wasa?

source: TENTU
en: of

source: KERAS UNTUK PEMBE-
en: with the land acquisition

source: ANDA SEPERTI SIMBAH-
en: believe something like that.

source: PAN!!
en: eight!

source: KAN UNTUK MELAKUKAN
en: to hold

source: JATUH KE LUBANG
en: into a three-meter

source: KAU BUKAN
en: what kind of

source: BUKAN SESEORANG,
en: not “someone,”

source: KARENA MASIH PUNYA
en: you still have

source: ..LALU ITU
en: and that

source: UDAH?!
en: I’ve turned it off!

source: BUKANKAN MEMANG SELAMA INI AKU SELALU MEMPRIORITASKAN PEKERJAANKU DIBANDING ANAK-ANAK....?!
en: that I always put my work ahead of my own children.

source: Hihihi lucu banget, sih
en: aw... what a cutie.

source: KAMU JUGA..
en: you

source: UNTUK MEMBERI
en: to say goodbye

source: ..MUAHAHAHAA!!
en: mwahahaha!

source: Ngomong apa kamu?
en: what are you on about?

source: APA YANG SUDAH KAU
en: what have you done

source: ANJASSS..
en: anjas!

source: TTOTT
en: sob sob

source: AH, BAIK..
en: oh, okay, sir.

source: SUDAH TAHU..
en: the rest...

source: KARENA MASIH BANYAK
en: because

source: SEKALI MENGHABISI-
en: to finish you off

source: PRANGGGG!!!
en: crash

source: Kok nggak ada jawaban sich!!
en: no one answered the door.

source: MASUK KE DIMENSI
en: you’ve managed to get

source: Keluarkan semua kemampuan supranatural yang kau miliki, mbah!
en: unleash all of your supernatural powers, master!

source: ..KIKK???
en: eek?

source: SEMUANYA
en: everything

source: NGANGGUR BANGET,
en: seem busy,

source: BERISIK ALAT BERAT
en: all the noise,

source: JADI KITA
en: so,

source: AWAS LO KENA KARMA!!
en: you’ll pay for this!

source: DENGAN RENCANAKU!!
en: something wrong!

source: YANG LAGI DORONG-
en: yeah, you...

source: SEDIH, LHO..
en: get hurt...

source: NGOMONG APA SIH
en: what are you

source: BWOOSHHHH
en: whoosh

source: KEBURU PEMBANGU-
en: before

source: MENDING KITA
en: let’s just

source: Beberapa jam sebelumnya
en: a few hours earlier

source: Setelah itu aku tidak bisa membantu lagi
en: and then I won’t be able to help you anymore.

source: NGGAK ADA YANG
en: don’t you

source: KAYAKNYA..
en: I think...

source: Gak, gapapa..
en: nah, never mind...

source: PANGGILAN
en: to go number two,

source: BISA SAJA DIA
en: maybe he didn’t want

source: BWOOH
en: whoosh

source: Jangan ganggu konsentrasiku!
en: I need to concentrate!

source: I-IYA BETUL,
en: y-yes,

source: BASAN LAHAN DI BARAT
en: on the west side.

source: COBA PIKIR LAGI!
en: think about it!

source: ..INI..
en: it’s...

source: NGGAK LOLOS
en: keep it

source: AKU, DIVA…
en: diva...

source: IYA, BU..
en: yes, ma’am.

source: SEGERA KEMBALI KE
en: get back to

source: ..BELUM ADA
en: we still

source: MBAK..
en: floor...

source: INI UJIAN..
en: you’ll get through it.

source: NIH..
en: move my leg...

source: SUMBER SUARA..
en: check on him...

source: SUKURIN!
en: serves you right!

source: SABAR YA, BU..
en: I’m sorry

source: INI..
en: well,

source: ORANG-ORANG INI SUDAH GILA!!!
en: these people are not right in the head!!!

source: DINNER DI RESTO
en: to a restaurant

source: AMBIL SINI,
en: come

source: KAN PERHATIANMU
en: attention

source: LE..LEPASKAN!!
en: l-let go!!!

source: JURU RUANGAN..!!
en: the room!

source: AYAH AJA, YA?
en: just call me, right?

source: (RASANYA HAMPA SEKALI TIDAK PUNYA TEMAN UNTUK BERBAGI...)
en: (it feels so empty to not have anyone to share this with...)

source: BANYAK, YA.
en: so much!

source: MASIH SAJA TIDAK
en: still wouldn’t

source: BILANG KALAU MASA
en: that your reigning

source: Hehehe..
en: hahaha...

source: KEBURU TUA, LHO!
en: to get married, right?

source: Permintaan maaf macam apa itu?!
en: what kind of ignorant apology is that?

source: DARI SEMUA PEN-
en: throughout

source: AMBIL DENGAN CARA-
en: just do it

source: CRIING!
en: clink

source: HATI
en: I see...

source: SATU TANDAN
en: fresh bananas!

source: ANJRIT?!?!
en: holy sh-!

source: MAKANYA KAMU
en: you should’ve

source: TIDAK PERCAYA DENGAN
en: believe in

source: ITU KELUARGAMU
en: if someone talked

source: MUKANYA
en: I think

source: INGAT UMUR!!
en: you’re no longer in your twenties!!!

source: JENTIKAN JARI
en: of a finger.

source: ..TINGGI..!!
en: so high,

source: PETUNJUK
en: his help.

source: IYA, IYA..
en: okay, okay...

source: ANDA, PAK J..!!
en: mr. J!

source: MONYET ITU
en: really

source: ADA BEKAS ANAK
en: a guy who used to

source: Walau halangan rintangan membentang..
en: no matter what obstacle was put before him...

source: LELAKI
en: I hate

source: Ohh??
en: oh?

source: KEKUATAN DARI
en: “his”

source: SIAP,
en: leave it to me,

source: P..
en: m-

source: TERSEDOT KE PUSAT
en: seems to draw

source: PROVIDER SIALAN..
en: darn cellular provider!

source: ..MUNGKIN AKU TERLANJUR TAK SANGGUP JAUH DARI DIRIMU...
en: and I don’t know how I’d live without you~

source: BAGAIMANA CARANYA
en: how to

source: TIDAK
en: what, you can’t use

source: DI AWAL SAJA
en: from the beginning.

source: ..POHON CEMARA..
en: it should be a forest full of trees...

source: ITU..!!
en: greasy hair of yours!

source: MENJAGA
en: that my family

source: CEPAT.
en: FAST

source: APA INI?
en: feeling?

source: KAKIKU… UGH..
en: my leg... ugh...

source: AKU MASIH MUDA,
en: I’m still young,

source: NGGAK JAUH DARI
en: it’s not too far

source: MEMBERIKANMU
en: with

source: BERIKAN MEREKA
en: bring them

source: DI BAWAH POHON
en: under

source: MENYURUH SALAH
en: I asked

source: R-RAMBUT
en: g-

source: Hehe, sebenernya aku lagi pengen makan sushi..
en: well, actually I’m craving some sushi.

source: AYO DIBUKA TANGAN-NYA!
en: stretch your hands out!

source: PASIEN ITU, KOK!!
en: hospital gown!

source: ..AKAN KUBUAT
en: I’m gonna

source: AKU, WOI!!!
en: to me, you ignorant fool!

source: BAGI AYAH..
en: it seemed as if...

source: SEMOGA UPACARA PENGORBANANNYA BERJALAN DENGAN LANCAR, SETELAH ITU DIA JANJI AKAN MEMBANTUKU MENGURUS KLIEN-KLIENKU YANG TERLANTAR
en: I just hope that the sacrificial ceremony goes well, because he promised he would help me take care of my clients I’d been neglecting.

source: KAYAKNYA KITA JANGAN
en: I think we shouldn’t

source: SUPPLIERNYA?!
en: a supplier for this?!

source: Ah, sayang sekali..
en: ah, too bad...

source: YA, MAS?
en: such a clever boy!

source: Banyak pohon cemara..
en: a forest full of trees~

source: KOK MALAH
en: are

source: WAKTU ISTIRAHAT
en: break time’s almost over,

source: *CANCEL*
en: *decline*

source: SAJA RITUALNYA?!
en: the ritual!

source: ADA KERJAAN, NIH..
en: to work.

source: CARA LAIN, AKU
en: no helping it,

source: DI DUNIA INI, BERHENTI-
en: So,

source: GRETEK!
en: rattle

source: MAMAH!!
en: mom!

source: Yah?
en: honey,

source: ITU, KAN??
en: the deal, right?

source: MERAIH TULANG
en: to caress

source: Ohoho..
en: oh right...

source: MBAK BANGUN,
en: wake up!

source: ALAHKANMU
en: to beat you.

source: MIMPI!!!
en: dreaming!

source: TANPA KALIAN PERLU
en: I don’t need you to fill me in with the details

source: MODE LANDSCAPE SAJA, YAH!
en: turn the phone sideways

source: CUKUP UNTUK MEMANG-
en: to summon

source: INI..?!
en: this mean?!

source: BISA KITA LAKUKAN…
en: nothing we can do...

source: HARUS LAPOR DULU
en: if I want to

source: NIMBRUNGNYA,
en: joined you guys

source: KAMU DIMANAA??
en: where the heck are you?!

source: TIDAK BERPINDAH
en: hadn’t

source: Yah..
en: well...

source: PUNYA CUKUP ENERGI
en: your back-up energy

source: MELULU!
en: his focus!

source: PERTAMA ITU..
en: that first “incident,”

source: JADI KECIL
en: so tiny,

source: GROOKK
en: snort

source: Tapi kan aku hanya mencoba untuk membantu--
en: but I was just trying to help--

source: BANG…
en: handsome...

source: dia kan punya nama dan jabatan
en: since he’s quite famous and powerful.

source: KU BEGINI..
en: just killed him.

source: HARUSNYA..
en: it

source: SETIDAKNYA PURA-PURA SENANG, KEK..
en: can’t you at least pretend to be happy?

source: Naik-naik ke puncak gunung (5)
en: let’s climb to the mountain top (5)

source: KALAU AKU BISA MEMBELAH GUNUNG INI UNTUK MENEMUKAN PUTRIKU, PASTI SUDAH KULA-KUKAN!!
en: I would slash my way through this mountain to find my daughter if I could!

source: BAWAMU KE HOTEL
en: can take you

source: DUKUN DEKIL!!
en: like you!

source: EHHH?!?!?!
en: huh?!

source: MANA MUNGKIN DIA BERANI KELUYURAN..
en: she’s a homebody,

source: BARU SAJA DIBI-LANGIN MAMAH..
en: he sure is a hard-headed!

source: TUH!!
en: are here!

source: HARUSKAH KITA ULANGI
en: maybe we should redo

source: KHHHH..!!!
en: ecch!!!

source: Kamar itu ditempati tamu istimewa bos Sima
en: it’s for the room where boss sima's guest of honor is staying.

source: MASUK KE SANA…
en: go there...

source: APAKAH MUNGKIN..
en: could there be...

source: Dan dimulailah perjalanan seekor kera saktu ke barat mencari kitab suci..
en: and so begins the journey of the monkey king to the west in search of the sacred book.

source: BERKELILING DUNIA
en: and explore

source: DAK!
en: (redacted)

source: KALIAN?!
en: are you two?!

source: GARA TERLALU
en: since I was so

source: HORE!
en: yay!

source: TEMU DENGANNYA..
en: to see him

source: ..MBA..
en: master...

source: GH!!
en: (redacted)

source: JIKA
en: I wouldn’t

source: GLEK!!
en: gulp

source: TIDAK MAU, YAH!!
en: no way!

source: Itulah yang terjadi..
en: that’s what happened.

source: CEPAT KERJA!!
en: get back to work!

source: SILAU..!!
en: I can’t see!

source: APAAN TUH??)
en: what was that?)

source: AYAH!
en: hey, dad!

source: TEMPATNYA
en: that place

source: DIT!!!!
en: adit!!!

source: BEGITU
en: like that too.

source: SEMUA INI TERJADI..
en: all of this,

source: DENGAN TANGANNYA
en: with his

source: BALIK, TCH…
en: so pathetic...

source: YA ITU
en: well,

source: MINGGU DEPAN!
en: next week.

source: NGGAK MUNGKIN
en: I don’t think

source: TANGGUNG JAWAB
en: of taking the responsibility,

source: ANAK BARU, YA?!
en: are you the new guy?!

source: DI KELAS, LUMAYAN
en: last semester.

source: APAAN
en: what

source: ..KOK BISA
en: how did

source: KAKI, AKU JUGA AKAN
en: I’m gonna take

source: HEYAAHH!!
en: I’m coming, kids!!!

source: YA!!
en: okay?!

source: HAHAHAHAHA!!
en: mwahahaha!

source: Gak..
en: no need...

source: ENYAHLAH
en: make yourselves

source: OMG..
en: my god...

source: PANDANGAN YANG
en: we looked deeply

source: JANJIKU..!!
en: promise!

source: AURA JIN PENUNGGU
en: from the jinn

source: NYAWA YANG DIA
en: has he

source: Maafkan ayah..
en: I’m so sorry.

source: JANGAN BEGITU..!!
en: you shouldn’t be like that!

source: ITU MAH PENGECUT!
en: what a wuss!

source: CICILANNYA BELUM
en: has not yet been

source: PEKERJA KITA YANG MASIH
en: many construction workers

source: sembarangan masuk ke tenda anak saya, jelas-jelas anda punya maksud buruk, kan?!
en: I knew you were up to no good when you walked out of my children’s tent!

source: SAMA YANG 'JAGA'
en: okay?

source: BARU AKU AKAN
en: I’ll let you

source: HUH!!!!
en: tsk!!!

source: MAU KEMBALI
en: to get back

source: Konsol game
en: video game console

source: TUNGGULAH PEMBALASANKU!!
en: just wait for my payback!

source: KUBIARKAN DIA
en: let him

source: DARI MAMAH?
en: did your mom tell you?

source: SESUAI INSTRUKSI
en: as

source: Tinggi sekali..
en: so high in the sky~

source: Kumohon, terakhir kali ini saja!!
en: Please, this will be the last time I ask for your help!

source: KECELAKAAN BIASA,
en: an accident,

source: PAKSAAN!!!
en: a little bit of force!

source: TAHUN YANG LALU..
en: ago.

source: MANUSIA YANG TELAH
en: of those who have

source: BERMIMPI DIDATANGI
en: by a scary man,

source: SEPERTINYA YANG
en: tresno is

source: PADAHAL DIA MASIH
en: he was

source: MEDIA YANG HARUS KITA
en: those perky reporters up,

source: TENTU SAJA BELUM
en: not finished

source: SHAAA
en: whoosh

source: KAN UDAH PAS BANGET NIH LAGU-NYA SAMA DESTINASI WISATA KITA!
en: this song fits with where we’re going.

source: Dia mau melihatku mati kelaparan, ya!?
en: he really wants me to starve to death, huh?!

source: GROOKKKK!!!
en: zzz!!!

source: KEMUDIAN TERIAKAN
en: followed by tresno’s

source: AUTHORNYA
en: the author

source: PEMANASAN DULU YAA, PEMIRSA YANG ADA DI RUMAH!
en: now, let’s do some warming up

source: MALAH NYAMPAH
en: throwing your stuff

source: SIAKAN..
en: your loss.

source: LOH?
en: oh?

source: KAN SUATU AURA
en: a very

source: JIMBUNG..
en: power.

source: HAPE LAMANYA LANGSUNG
en: and now he’s throwing away

source: MAMAHHH..
en: honey...

source: Aku juga..
en: so will I.

source: HEI, HEI..
en: hey...

source: SRAAK!!
en: rustle

source: TANDA-TANDANYA SUDAH TERLIHAT, KITA HANYA PERLU MENUNGGU PETUNJUK DARI MBAH SURO..
en: now that the signs have appeared, it’s time for us to seek master suro’s guidance.

source: ITU MASIH KURANG,
en: that sufficient,

source: MENYAMAR!!
en: in disguise!

source: AKU NGGAK APA-APA, MAH..
en: I’m fine, honey.

source: KAN, SARIMIN?!
en: now, sarimin?!

source: HEHE, SUDAH
en: haha,

source: SEPERTINYA INI SALAH
en: I think we’ve reached

source: WAHAI JIN MONYET
en: white monkey

source: BABI NGEPET!!
en: by a demon boar!

source: Mereka pasti lewat sini!!!
en: they must’ve gone this way!

source: KELUARKAN
en: show me

source: MUNGKIN….
en: way...

source: UNTUK MANTAN
en: for my

source: RAK!!
en: (redacted)

source: Tapi kamu membiarkan anak-anaknya hidup..
en: you spared their kids.

source: Datanglah ide untuk mengembangkan aplikasi yang menghubungkan teknologi manusia and sihir para jin
en: and that’s when the idea to make an app that brings together human technology and jinns’ magic arose.

source: TUNJUKKAN HASIL
en: the fruit

source: TAHU TENTANG
en: anything

source: AKU BIKIN VIRAH, NIH!!
en: I’m going to make this viral!

source: MARAH SEKALI..!!
en: she’s going to kill me!

source: MENGINGATKU,
en: remember me,

source: DSADASFA!!
en: ouch!

source: WAKTU ITU?
en: the other day?

source: Terlalu banyak potensi yang terbuang!!
en: so wasteful!

source: KAN SAYA SURUH
en: I didn’t tell you

source: Cepat bereskan barang-barangmu dan enyahlah dari tempat ini, Sarimin..
en: sarimin... pack up your things and leave at once!

source: TINGGAL, KANTOR
en: sarimin’s

source: OLSHOP?
en: an online store?

source: TADI!!
en: before!

source: AKU SEBENARNYA
en: I could tell

source: OIYA, TAPI..
en: oh, anyway...

source: JANGAN MARAH (5)
en: don’t be mad (5)

source: KABUR, AH..
en: gotta go!

source: AKU MELAKUKAN-NYA JUGA DEMI MEREKA..
en: I do it for their own good.

source: YAH, KELUARGA
en: well, tresno’s

source: DENGAN WAJAH BODOH
en: a man

source: LANTAI 18,
en: the 18th

source: BISA-BISA ADA
en: someone could’ve

source: PULANG!
en: home!

source: DI HADAPANKU!!
en: to me!

source: Selamat jalan, semoga selamat sampai tujuan
en: farewell and have a safe trip!

source: AKU TERSINGGUNG!!
en: do you take me for?!

source: MASIH PUNYA RASA
en: were

source: Cepat naik!
en: get in!

source: DASAR MANUSIA
en: damn you,

source: B-BAIK, PAK..
en: o-okay, sir...

source: KAU, MANUSIA..
en: son of a gun...

source: BUKAN SEKADAR
en: just

source: ASDFFGGJGKH!!!!!!!!
en: arghhhhh!!!

source: Woi itu biniku!
en: excuse me, she’s my wife!

source: BUKANNYA AKU SUDAH BILANG TENTANG LARANGAN MEMBAWA PELIHARAAN KE SINI?!!?
en: I told you not to bring pets here, didn’t I?

source: MENAMPARKU DENGAN
en: slap me

source: KAK?
en: natasya?

source: AKU NGGAK SENGAJA...
en: I didn’t mean to--

source: KAN, PAK?!
en: there’s

source: *orang gila!!
en: (redacted)

source: APA YANG TELAH KALIAN
en: to what you’ve taken

source: KAMI MENEMUKANNYA, MBAH!!
en: we found her, master!

source: ANGGOTA KELUARGA
en: everyone the same way,

source: BARUSAN TIBA..
en: has arrived.

source: YAH, KALAU
en: well,

source: AYAH AYO IKUT JUGA JANGAN MALAH BUKA LAPTOP!!
en: you should come too, honey! work can wait!

source: Ada yang tidak beres..
en: I don’t like this...

source: KELUARGAKU?
en: really my family?

source: ASADSFDS
en: ouch!

source: KLO
en: clang

source: Disuruh bubar sama si boss Sima
en: mr.sima told me to disband the group.

source: ZRAAHH!!
en: swoosh

source: LEMASKAN
en: loosen up

source: NGOMONG-NGOMONG, MAH..
en: by the way,

source: SEDANG MIMPI
en: he’s having

source: APA, PUR?!
en: mean?!

source: Ya, urusanku dengannya sudah selesai..
en: yeah, we’re done.

source: Pelayang sebelumnya melakukan kesalahan tersebut dan jadi trauma sampai sekarang!
en: the former maid made that mistake, and she’s been traumatized ever since.

source: Heheh..
en: hehe...

source: BAGI-BAGI MAKANANNYA PADAKUH!!!)
en: share your food with me!!!)

source: JANGAN, DONG!!
en: please don’t!

source: ..SUDAH BERAPA
en: how many lives

source: BEBERAPA WAKTU
en: a few moments

source: TIDAK TAHU KALAU
en: to know

source: Good boi!
en: good boy!

source: I'M
en: DM

source: AKU AKAN MENAMPILKAN TARI DAERAH!
en: I’m going to do a folk dance!

source: Keadaan makin sulit sekarang..
en: things are getting more difficult right now.

source: TERDENGAR SUARA
en: I heard the sound

source: HIBURAN BARU
en: my new form of entertainment.

source: KAMU LAKUKAN DI SINI?
en: you doing here?

source: KELUARGANYA
en: to his family.

source: TINGGAL NAIK SEDIKIT LAGI..
en: we’ll just have to climb up a bit more.

source: HANYA INGIN KELUARGA INI MEMILIKI MEMORI INDAH YANG INDAH YANG BISA DIINGAT OLEH ANAK-ANAK..
en: all I want is for my children to have a lovely memory of this family.

source: ..LAGI?
en: again?!

source: BERJALAN DENGAN
en: doing

source: BANTUAN LAIN
en: really use

source: SEMUANYA DARI BUKU
en: everything

source: AK!!
en: (redacted)

source: OIYA, HATI-HATI, DI BAGIAN SINI BATU-NYA AGAK LICIN!
en: watch your steps, it’s a bit slippery.

source: Enak juga, lho..
en: I believe they’re just as tasty!

source: YANG BENAR SAJA!!
en: have you two gone mad?!

source: TAPI SETELAH
en: when I’m done

source: AKU DI ALAM
en: where

source: UNTUK MENJADI
en: to be

source: DI SINI!?
en: here?!

source: KAN JIWA TERSEBUT
en: lend them to you

source: Huft, kembang apinya sudah habis..
en: oh no, I’ve run out of fireworks.

source: WAKTUMU,
en: your time,

source: BAJUNYA APA
en: outfit...

source: CTIK!
en: snap

source: KALAU TIDAK,
en: if I wasn’t,

source: JADI..
en: so...

source: DI SINI!!
en: doing!

source: AKU SEDANG DALAM
en: I’m in

source: DARI LOKASI UANGNYA
en: him

source: WAHAI
en: oh,

source: MANUSIA?!?!?!
en: world?!

source: GALIAN..
en: the ditch.

source: TEMAN DAN BELUM
en: my card, and he hasn’t

source: …BONEKANYA
en: the doll

source: DASAR
en: he sure

source: SI ANAK BARU!!
en: the new kid!

source: HEHE..
en: haha...

source: JRENG
en: dun

source: UDAH NGGAK KELIHATAN KOK, MAH!
en: it’s already out of sight, mom.

source: KARENA TERLUKA DI
en: being treated

source: ..SIAPA YA
en: but who should I pick

source: KOK NGGAK ADA
en: where’s

source: BUKA WEBTOON DI
en: open the webtoon app

source: JADI
en: is he

source: PAKSA KE TEMPAT INI..
en: against my own will...

source: ADA YANG
en: how may

source: KOMIK
en: my favorite series

source: MAH!!
en: oh, dear!

source: Dengan begini mereka akan tidur sampai besok pagi!!!
en: with this, they’ll be sleeping like a baby!

source: LUAR BIASA DARI
en: from each

source: KAKAK MAU KEMANA?!
en: where are you going?!

source: BEUHHH..
en: you’ll be

source: MAAF YA MAMAH TUH EMANG BISANYA CUMA NGECEWAIN KALIAN TERUS....
en: I’m sorry for being so unreliable.

source: CERITAKAN PUN AKU
en: since I already

source: PSSHH
en: hiss...

source: JANGAN PERGI SENDIRI!!
en: don’t wander off!

source: Tapi cepat atau lambar pasti akan ada yang mengisi
en: but I’m sure that sooner or later, someone will step in to fill the void.

source: NAM..
en: six...

source: HANDPHONE-KU!!!
en: my phone!!!

source: LANGSUNG BALIK,
en: get back here once you’re done,

source: INI KAN…!?!
en: what?!

source: Ini bukan sepenuhnya salahmu, kok..
en: it wasn’t entirely your fault.

source: TADI PADANYA!
en: the document!

source: KOK ANDA MAKSA
en: why are you

source: KAU KUIZINKAN
en: you can

source: Kalau boss Sima lebih ramah seperti tuan Sarimin, mungkin nggak akan jomblo sampai sekara----
en: if you were more outgoing like Sarimin, perhaps you wouldn’t be single right now--

source: MELIHAT DIRIKU
en: seeing

source: HUU HUUU
en: sob sob

source: ..DAN MEMINJAM
en: and borrowed

source: INI, YA??
en: it.

source: Naik-naik ke puncak gunung (6)
en: let’s climb to the mountain top (6)

source: KYAAHHHH..!!
en: gyaaah

source: DRRRRRR!!
en: bzzt

source: TIDAK MEMBERIKU
en: to give me

source: ERASI SEBAGAI DETEKTIF
en: he’s been busy acting

source: SEBENARNYA AKU
en: these guys

source: DENGAN SENANG
en: a part of you.

source: Yang benar saja!!
en: what?!

source: KEMARIN,
en: only yesterday...

source: TEPAT.
en: EXACT

source: DIA SEDANG MENULIS-
en: he’s trying to

source: PARFUMKU?!
en: of my perfume?!

source: MEMBAWA
en: I’m gonna die

source: TCH!!!
en: tsk!!!

source: KAYAK KUBURAN..
en: such eerie stillness...

source: JANGKAUAN..
en: unavailable.

source: RATNA TAHU
en: mom told

source: LAGI?
en: can we do?

source: MAS TRESNO!!
en: tresno!

source: Ah!
en: oh!

source: BISA AKU KENA
en: want to

source: *MELAYANG*
en: *float*

source: DIMAKAMKAN
en: was held

source: BALIK DEH,
en: it’s gonna be

source: SUARA MESIN TRUK ITU
en: the truck turned on

source: ITU MEREKA!!!
en: there they are!!!

source: MEMBERIKANKU
en: to

source: KAKI SAYA JUGA?
en: my leg back?

source: LANGSUNG MENGAJUKAN
en: submitted

source: AKAN AKU
en: I’ll

source: TIDAAKKK!!!
en: nooo!!!

source: MAKSAMU..
en: to come down to this...

source: SEPERTI NINJA!!
en: are you a ninja?!

source: Percuma saja anda berteriak sekeras apapun untuk meminta bantuan..
en: you’re just wasting your time yelling for help.

source: MELULU..
en: in his moves.

source: CEPAT PULANG-
en: hurry

source: MEMANG BEGITU RISIKO-
en: this is what you’ll have to deal with

source: MEMBAWAMU KE HOTEL
en: that I could take you

source: ARGHH1
en: arghh!

source: KALAU ITU
en: about that...

source: SOLUSINYA!
en: IS THE ANSWER!

source: KYAAA!!
en: aaah!!!

source: MASIH BANYAK
en: I still

source: GA..
en: three...

source: PERCAYALAH PADAKU!!
en: please believe me!

source: Siapapun..?
en: anyone?

source: BAHKAN KAU
en: you couldn’t

source: LANGSUNG TELPON
en: you could

source: Apa yang mereka inginkan selain uang?!
en: what else do they want from us besides money?!

source: TAPI KEKALAHANKU
en: but I could

source: BENGONG DI SITU?!
en: doing over there?!

source: TERUTAMA KALAU
en: that’s why safety measures

source: APA YANG BISA
en: anything

source: SUDAH PASTI INI
en: there’s no mistaking it,

source: BENTAR..
en: let’s see...

source: KE MEREKA
en: that easily.

source: TERMASUK TEMPAT INI..
en: ...including this place.

source: JUMLAH PEKERJA YANG
en: of accidents

source: SEKALI BABI NGEPET
en: this boar still

source: KEPIKIRAN APA, SAYANG?
en: what is it, sweetheart?

source: BISA LANGSUNG
en: had wasa answered

source: KIRA-KIRA
en: is there

source: DIA
en: he seems

source: MENYANGKA AKAN
en: that it would

source: YA AMPUN..
en: oh my god.

source: ..MAKHLUK YANG
en: I think

source: NYA DULU PAS LEBIH
en: at such a young age, huh?
